      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 20. August. 2026     ###
      * ### Aktua: 20. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       FD REPORT-CNBV-R01-A-0111-DF.
       01 REPORT-CNBV-R01-A-0111.
          02 A PIC A(1) DISPLAY.
      *****************************************************************