      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 20. August. 2026     ###
      * ### Aktua: 20. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       01 LS-REPORT-CNBV-NAME-DF.
          02 LS-REPORT-CNBV-DF-PATH      PIC A(17) DISPLAY.
          02 LS-REPORT-CNBV-DF-NUMBER    PIC 9(04) DISPLAY.
          02 LS-REPORT-CNBV-DF-EXTENSION PIC A(05) DISPLAY.

       77 LS-REPORT-CNBV-R01-A-0111 PIC X(01) DISPLAY.
      *****************************************************************