      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 20. August. 2026     ###
      * ### Aktua: 20. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       01 WS-REPORT-CNBV-DF-NAME.
          02 WS-REPORT-CNBV-DF-FILE      PIC A(17) VALUE SPACE DISPLAY.
          02 WS-REPORT-CNBV-DF-NUMBER    PIC 9(04) VALUE ZERO  DISPLAY.
          02 WS-REPORT-CNBV-DF-EXTENSION PIC A(05) VALUE SPACE DISPLAY.

       77 WS-REPORT-CNBV-R01-A-0111-FST PIC X(02) DISPLAY.
      *****************************************************************