      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 20. August. 2026     ###
      * ### Aktua: 20. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       77 WS-REPORT-CNBV-R01-A-0111-FST PIC X(02) DISPLAY.
      *****************************************************************