      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 20. August. 2026     ###
      * ### Aktua: 20. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       01 WS-REPORT-CNBV-DF-NAME.
          02 FILLER PIC X(17) VALUE "test/cnbv/report_" DISPLAY.
          02 WS-REPORT-CNBV-DF-NUMBER PIC 9(04) VALUE ZERO  DISPLAY.
          02 FILLER PIC X(05) VALUE "_.txt" DISPLAY.

       77 WS-REPORT-CNBV-R01-A-0111-FST PIC X(02) DISPLAY.
      *****************************************************************