      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 16. August. 2026     ###
      * ### Aktua: 16. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################


       77 WS-TRNC-BANK-FILE-STATUS PIC X(2).