      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 17. August. 2026     ###
      * ### Aktua: 17. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       FD REGISTER-BANK-DF.
       01 FS-REGISTER-BANK.
          02 RK-REGISTER-BANK-FID      PIC X(18)  DISPLAY.
          02 ARK-REGISTER-BANK-COUNTRY PIC A(02)  DISPLAY.
          02 ARK-REGISTER-BANK-NAME    PIC X(255) DISPLAY.

      *****************************************************************