      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 17. August. 2026     ###
      * ### Aktua: 17. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       01 LK-REGISTER-BANK.
          02 LK-REGISTER-BANK-FID     PIC X(18)  DISPLAY.
          02 LK-REGISTER-BANK-COUNTRY PIC A(02)  DISPLAY.
          02 LK-REGISTER-BANK-NAME    PIC X(255) DISPLAY.
      *****************************************************************