      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 17. August. 2026     ###
      * ### Aktua: 17. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       01 LK-BANK.
          02 LK-BANK-FISCAL-ID PIC 9(18) COMP-5.
          02 LK-BANK-COUNTRY   PIC A(02) DISPLAY.
      *****************************************************************