      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 17. August. 2026     ###
      * ### Aktua: 17. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################
      
      *****************************************************************
       01 WS-REGISTER-BANK.
          02 WS-REGISTER-BANK-FID     PIC X(18)  VALUE SPACES DISPLAY.
          02 WS-REGISTER-BANK-COUNTRY PIC A(02)  VALUE SPACES DISPLAY.
          02 WS-REGISTER-BANK-NAME    PIC X(255) VALUE SPACES DISPLAY.

       77 WS-REGISTER-BANK-FST PIC X(02) DISPLAY.
      *****************************************************************