      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. main.
       AUTHOR. Reymon Dev.
       DATE-WRITTEN.  18. April. 2026
       DATE-COMPILED. 17. August. 2026
      *****************************************************************

      *****************************************************************
       ENVIRONMENT DIVISION.
      *****************************************************************

      *****************************************************************
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       COPY "account/ws.cpy".
      *****************************************************************

      *****************************************************************
       PROCEDURE DIVISION.
           DISPLAY "Hola Mundo".
           CALL "rcbs_register_bank_create".
           STOP RUN.
      *****************************************************************