      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. rcbs_register_bank_create IS RECURSIVE.
       AUTHOR. Reymon Dev.
       DATE-WRITTEN.  16. August. 2026
       DATE-COMPILED. 17. August. 2026
      *****************************************************************

      *****************************************************************
       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *****************************************************************

      *****************************************************************
       DATA DIVISION.

       FILE SECTION.

       LOCAL-STORAGE SECTION.

       LINKAGE SECTION.

      *****************************************************************

      *****************************************************************
       PROCEDURE DIVISION.

           GOBACK.
      *****************************************************************