      * ###################################
      * ### Autor: Eduardo Pozos Huerta ###
      * ### Datum: 20. August. 2026     ###
      * ### Aktua: 20. August. 2026     ###
      * ### Lizenz: MIT                 ###
      * ###################################

      *****************************************************************
       *>77 WS-ACCOUNT-DF-NAME PIC A(99) VALUE "rcbs/account.db" DISPLAY.
      *****************************************************************