      ************************************************
      *** SPDX-License-Identifier: AGPL-3-or-later ***
      ************************************************

      ************************************
      *** Author: Eduardo Pozos Huerta ***
      *** File: reydb-linking.cbl      ***
      *** Date: 11/03/2025             ***
      *** Update: 11/04/2025           ***
      ************************************

      ****************************
      *** Database linkng file ***
      ****************************

       01 REYDB-LINKING.
           05 REYDB-LINKING-ID          PIC 9(18).
           05 REYDB-LINKING-NAME        PIC A(64).
           05 REYDB-LINKING-AGE         PIC 9(03).
           05 REYDB-LINKING-BIRTHDAY    PIC 9(02).
           05 REYDB-LINKING-MONTH-BIRTH PIC 9(02).
           05 REYDB-LINKING-YEAR-BIRTH  PIC 9(18).