      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. rcbs_transaction_transfer.
       AUTHOR. Reymon Dev.
       DATE-WRITTEN.  18. April. 2026
       DATE-COMPILED. 18. August. 2026
      *****************************************************************

      *****************************************************************
       ENVIRONMENT DIVISION.
      *****************************************************************

      *****************************************************************
       DATA DIVISION.
      *****************************************************************

      *****************************************************************
       PROCEDURE DIVISION.
      *****************************************************************

      *****************************************************************
           GOBACK.
      *****************************************************************